_protected/views/layouts/main.php

SELECT * FROM `profile` WHERE `id`=54
---
<?php
Yii::$app->user->isGuest ? $user_id = '99' : $user_id = Yii::$app->user->id;

$userModel = \app\models\Profile::findOne(Yii::$app->user->identity->profile_id);

SELECT * FROM `user_state` WHERE `user_id`=10012
---
$userImage = $userModel->getImageUrlThumbnail();

?>
<?php if (UserState::findOne(['user_id' => $user_id])->value == 1): ?>

SELECT * FROM `profile` WHERE `id`=54
---
                    <?php if (!Yii::$app->user->isGuest): ?>
                        <!-- User Account: style can be found in dropdown.less -->
                        <li id="lang-selector2" class="dropdown">
                            <?php if (\app\models\Profile::findOne(Yii::$app->user->identity->profile_id)->language == 'id-ID'): ?>