_protected/controllers/EducationController.php

    public function actionTabularform()
    {
        if (empty(Yii::$app->user->identity->profile_id)) {
            return $this->render('error');
        } else {

            $model = new Education();
            $dataProvider = new ActiveDataProvider([
                'query' => Education::find()->where(['profile_id' => Yii::$app->user->identity->profile_id])->indexBy('id')->orderBy('level'),
            ]);
---
SELECT * FROM `education` WHERE `profile_id`=54 ORDER BY `level` LIMIT 20
SELECT COUNT(*) FROM `education` WHERE `profile_id`=54