_protected/controllers/ProfileController.php

SELECT * FROM `profile` WHERE `id`=54
---
    protected function findModel($id)
    {
        if (($model = Profile::findOne($id)) !== null) {