_protected/controllers/SiteController.php

SELECT * FROM `profile` WHERE `id`=54
---
    public function actionIndex()
    {
        if (Yii::$app->user->can('admin')) {
            return $this->redirect('lecturer/index2');
        } elseif (Yii::$app->user->can('sadmin')) {
            return $this->redirect('user/index');
        } else {
            $profile = Profile::findOne(Yii::$app->user->identity->profile_id);

SELECT * FROM `profile` WHERE `id`=54
---
    public function actionDashboard()
    {
//        return $this->render('about');
        $profile = Profile::findOne(Yii::$app->user->identity->profile_id);