_protected/controllers/UserstateController.php

SELECT * FROM `user_state` WHERE (`user_id`=2) AND (`name`='sidebar')
---
    public function actionSave($name, $value)
    {
        if (Yii::$app->user->isGuest) {
            $model = UserState::findOne(['user_id' => 99]);
            $model->name = $name;
            $model->value = $value;
            $model->save();
        } else {
            $model = UserState::findOne(['user_id' => Yii::$app->user->id, 'name' => $name]);