_protected/models/ChangePasswordForm.php

SELECT * FROM `user` WHERE `id`=3
---
    public function validatePassword($attribute, $params)
    {
        if (!$this->hasErrors()) {
            $user = \app\models\User::findOne(Yii::$app->user->id);

SELECT * FROM `user` WHERE `id`=3
UPDATE `user` SET `password_hash`='$2y$13$.4hqMrrDbsl/vXdzu4GDmet/hPTmbaJEZ64.C63U1r37gsJy.xbsS', `updated_at`=1509592859 WHERE `id`=3
---
    public function changePassword()
    {
        if ($this->validate()) {
            $user = \app\models\User::findOne(Yii::$app->user->id);
            $user->setPassword($this->newPassword);
            $user->save(false);